In [5]:
import pandas as pd
import numpy as np
from scipy import stats

excel_file = pd.ExcelFile("Stats.xlsx", sheet_name = 0, header = 0)

pd = excel_file.parse()
data = pd[["YearsOfExp","Salary in Rs."]]
data_salary = pd["Salary in Rs."]

print("Mean Salary for Different Groups of Years Of Experience")
data.groupby("YearsOfExp").mean()

Mean Salary for Different Groups of Years Of Experience

            Salary in Rs.
YearsOfExp
1                12598.00
2                25169.00
3                37552.00
4                50209.50
5                62699.00
6                75392.00
7                87716.50
8               100639.00
9               112952.75
10              125484.20

In [6]:
print("Median Salary for Different Groups of Years Of Experience")
data.groupby("YearsOfExp").median()

Median Salary for Different Groups of Years Of Experience

            Salary in Rs.
YearsOfExp
1                 12598.0
2                 25206.5
3                 37552.0
4                 50209.5
5                 62699.0
6                 75392.0
7                 87716.5
8                100639.0
9                112941.0
10               125363.0

In [8]:
print("Mean Salary: {}".format(np.mean(data_salary)))

Mean Salary: 77821.2

In [9]:
print("Median Salary: {}".format(np.median(data_salary)))

Median Salary: 87654.0

In [10]:
print("Mode Salary: {}".format(data_salary.mode()))

Mode Salary: 0    100639
dtype: int64

In [6]:
stats.mode(data_salary)

ModeResult(mode=array([100639], dtype=int64), count=array([2]))